        var x = 6
        var y = 14
        var z =4 

        x += y - x++ * z;
        document.write(x +"<br/>");
       /* Вiдповiдь: -4; Спочатку выконуеться x++ * z = 24 тут вищiй прiорiтет, 
       потiм y - x++ * z = -10 тому що у - приорiтет вище нiж у +=; 
       та в кiнцi 6+(-10)= -4: */
       
       var x = 6
       var y = 14
       var z =4 
       z = --x - y * 5 ;
       document.write(z +"<br/>");
       /* Вiдповiдь: z = -65; x = 6, но у прикладi з нього ми забираемо 1 дiэю --x, тепер x=5
       далi y*5 = 70, 
       5-70= z = -65 */

       var x = 6
       var y = 14
       var z =4 

       y /= x + 5 % z; 
       document.write(y +"<br/>");

       /* Вiдповiдь : y = 2; 
       5%z = 5%4 остача 1, далi ми x + 1 (6+1=7);
       y /= 7, 14/7=2;*/

       var x = 6
       var y = 14
       var z =4 

       result = z - x++ + y * 5;
       document.write(result +"<br/>");
       /* спочатку z - x++ (але не встигае) = -2 
          потiм y * 5 = 70
          потiм -2 + 70 = 68
          Вiдповiдь: 68;
       */
      
       var x = 6
       var y = 14
       var z =4 

       x = y - x++ * z;
       document.write(x +"<br/>") ;
       /* спочатку виконуеться x++ * z, але iнкремент не встигает додати 1 и тому вiдповiдь 6*4=24;
       далi ми y-24 (14-24) = x = -10;
       Вiдповiдь: -10; */
